ТОИР_демо/src/Catalogs/торо_ТехКарты/торо_ТехКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТехКарты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержитОпасныеОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитРаботыПовышеннойОпасности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнениеРемонтаТребуетОстановаОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростоя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПростоя</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремениТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростояТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПродолжительности</name>
    <type>
      <types>EnumRef.торо_СпособыРасчетаПродолжительности</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданаАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОпераций</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГраницаЛев</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГраницаПрав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремениВСекундах</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериальныеЗатраты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.ГрадацииКачества</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТрудовыеЗатраты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество работников данной квалификации необходимое для выполнения тех.операции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнструментыИТехника</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Инструмент</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмеряемыеПоказатели</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОказываемыеУслуги</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МерыБезопасности</name>
    <attributes>
      <name>МерыБезопасности</name>
      <type>
        <types>CatalogRef.торо_МерыБезопасности</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВерсииТехКарт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Catalogs/торо_ТехКарты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Процедура - Рассчитать продолжительность по операциям
//
// Параметры:
//  ПоНормамТО	 - Булево - выполнять ли расчет по нормам ТО.
Процедура РассчитатьПродолжительностьПоОперациям(ПоНормамТО = Ложь) Экспорт
	
	Продолжительность =  РассчитатьПродолжительность(ПоНормамТО);
	ТекстПродолжительности = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(Продолжительность);
	
	НормаВремени      = Продолжительность;
	НормаВремениТекст = ТекстПродолжительности;
	
КонецПроцедуры

// Процедура - Рассчитать продолжительность по трудозатратам
Процедура РассчитатьПродолжительностьПоТрудозатратам() Экспорт
	
	Продолжительность = 0;
	Для Каждого СтрокаТЧ Из ТрудовыеЗатраты Цикл
	
		Продолжительность = Продолжительность + СтрокаТЧ.ВремяРаботы;
	
	КонецЦикла; 
	
	РассчитатьПродолжительностьВложеннойТехКартыПоТрудозатратам(СписокОпераций, Продолжительность);
	
	ТекстПродолжительности = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(Продолжительность);
	
	НормаВремени      = Продолжительность;
	НормаВремениТекст = ТекстПродолжительности;

	
КонецПроцедуры

Процедура РассчитатьПродолжительностьВложеннойТехКартыПоТрудозатратам(табСписокОпераций, Продолжительность)
	
	Для каждого СтрОперации Из табСписокОпераций Цикл
		
		Если ТипЗнч(СтрОперации.Операция) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
			Продолжить;
		Иначе
			ОперацияТехКарта = ПолучитьТехКартуПоИдентификатору(СтрОперации.Операция);
			
			Если ОперацияТехКарта <> ПредопределенноеЗначение("Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка") Тогда
				Продолжительность = Продолжительность + ОперацияТехКарта.ТрудовыеЗатраты.Итог("ВремяРаботы");
			КонецЕсли;
			
			РассчитатьПродолжительностьВложеннойТехКартыПоТрудозатратам(ОперацияТехКарта.СписокОпераций, Продолжительность);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТехКартуПоИдентификатору(Идентификатор, Дата = Неопределено)
	
	Если Не Дата = Неопределено Тогда
		Таб = РегистрыСведений.торо_ВерсииТехКарт.СрезПоследних(Новый Граница(Дата,ВидГраницы.Включая),Новый Структура("ИдентификаторТехКарты", Идентификатор));
	Иначе
		Таб = РегистрыСведений.торо_ВерсииТехКарт.СрезПоследних(    ,Новый Структура("ИдентификаторТехКарты", Идентификатор));// обработано
	КонецЕсли;
	
	Если Таб.Количество() Тогда
		Возврат Таб[0].ТехКарта;
	Иначе
		Возврат Справочники.торо_ТехКарты.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА торо_ТехКартыСписокОпераций.Операция ССЫЛКА Справочник.торо_ИдентификаторыТехКарт
	               |			ТОГДА торо_ВерсииТехКартСрезПоследних.ТехКарта
	               |		ИНАЧЕ торо_ТехКартыСписокОпераций.Операция
	               |	КОНЕЦ КАК Состав,
	               |	ВЫБОР
	               |		КОГДА торо_ТехКартыСписокОпераций.Операция ССЫЛКА Справочник.торо_ИдентификаторыТехКарт
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Операция_Техкарта,
	               |	торо_ТехКартыСписокОпераций.Количество
	               |ИЗ
	               |	Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&ДатаПринятия) КАК торо_ВерсииТехКартСрезПоследних
	               |		ПО торо_ТехКартыСписокОпераций.Операция = торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты
	               |ГДЕ
	               |	торо_ТехКартыСписокОпераций.Ссылка = &Ссылка
	               |	И торо_ТехКартыСписокОпераций.Операция ССЫЛКА Справочник.торо_ИдентификаторыТехКарт";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ДатаПринятия", новый Граница(ДатаПринятия,ВидГраницы.Включая));
	ТабДанных = Запрос.Выполнить().Выгрузить();
	
	ТабЗаписи = ТабДанных.Скопировать();
	
	Для каждого ТекСтрока Из ТабДанных Цикл
		ДополнитьТаблицуТехкарт(ТекСтрока.Состав,ТабЗаписи);
	КонецЦикла;
	
	ТабЗаписи.Свернуть("Состав","Количество");
	
	НаборЗаписей = РегистрыСведений.торо_СоставИерархическихТехкартРемонтов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Техкарта.Установить(Ссылка);
	
	Для каждого ТекСтрока Из ТабЗаписи Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Техкарта = Ссылка;
		Запись.Состав = ТекСтрока.Состав;
		Запись.Количество = ТекСтрока.Количество;
	КонецЦикла;
	
	НаборЗаписей.Записать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ДополнитьТаблицуТехкарт(техКарта,ТабЗаписи)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА торо_ТехКартыСписокОпераций.Операция ССЫЛКА Справочник.торо_ИдентификаторыТехКарт
	               |			ТОГДА торо_ВерсииТехКартСрезПоследних.ТехКарта
	               |		ИНАЧЕ торо_ТехКартыСписокОпераций.Операция
	               |	КОНЕЦ КАК Состав,
	               |	ВЫБОР
	               |		КОГДА торо_ТехКартыСписокОпераций.Операция ССЫЛКА Справочник.торо_ИдентификаторыТехКарт
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Операция_Техкарта,
	               |	торо_ТехКартыСписокОпераций.Количество
	               |ИЗ
	               |	Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&ДатаПринятия) КАК торо_ВерсииТехКартСрезПоследних
	               |		ПО торо_ТехКартыСписокОпераций.Операция = торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты
	               |ГДЕ
	               |	торо_ТехКартыСписокОпераций.Ссылка = &Ссылка
	               |	И торо_ТехКартыСписокОпераций.Операция ССЫЛКА Справочник.торо_ИдентификаторыТехКарт";
	
	Запрос.УстановитьПараметр("Ссылка",техКарта);
	Запрос.УстановитьПараметр("ДатаПринятия", новый Граница(ДатаПринятия,ВидГраницы.Включая));
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТабЗаписи.Добавить(),Выборка);
		ДополнитьТаблицуТехкарт(Выборка.Состав,ТабЗаписи);
	КонецЦикла;
КонецПроцедуры

Функция РассчитатьПродолжительность(ПоНормамТО = Ложь)
	
	Продолжительность = 0;
	
	Для Каждого СтрокаОпераций Из СписокОпераций Цикл
		
		Если ТипЗнч(СтрокаОпераций.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда
			Таб = РегистрыСведений.торо_ВерсииТехКарт.СрезПоследних(?(ЗначениеЗаполнено(ДатаПринятия), ДатаПринятия, ТекущаяДата()), Новый Структура("ИдентификаторТехКарты", СтрокаОпераций.Операция));
			Если Таб.Количество() > 0 Тогда
				
				ТехКартаСсылка = Таб[0].ТехКарта;
				
			Иначе
				Продолжить;
			КонецЕсли; 
		КонецЕсли;
		
		Продолжительность = Продолжительность + ?(ТипЗнч(СтрокаОпераций.Операция) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт")
													, ?(ПоНормамТО, ТехКартаСсылка.НормаВремени          , СтрокаОпераций.НормаВремениВСекундах)*СтрокаОпераций.Количество
													, ?(ПоНормамТО, СтрокаОпераций.Операция.НормаВремени , СтрокаОпераций.НормаВремениВСекундах)*СтрокаОпераций.Количество);
		
	КонецЦикла;
	
	Возврат Продолжительность;
	
КонецФункции

#КонецОбласти

#КонецЕсли
